wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
/**
 * @file test_mode.c
 * @brief UART0-driven hardware test mode implementation.
 *
 * Supports both an interactive UART menu entered by typing "test" and
 * the structured AT+TEST=<CMD> auto-test command interface.
 */
#include "test_mode.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "NuMicro.h"
#include "project_config.h"
#include "drivers/timer.h"
#include "drivers/led.h"
#include "drivers/buzzer.h"
#include "drivers/gsensor.h"
#include "drivers/adc.h"
#include "board/gpio.h"
#include "board/usb_hid/usb_hid_mouse.h"
#include "ble.h"
#include "system_status.h"

static volatile uint8_t g_uart_test_mode = 0u;

/* ------------------------------------------------------------------ */
/* UART0 helpers                                                       */
/* ------------------------------------------------------------------ */

/**
 * @brief Read one character from UART0 without blocking.
 * @param out Pointer to receive the character.
 * @return 1 if a character was read, 0 if no data is available.
 */
static int UART0_ReadCharNonBlocking(char *out)
{
    if (UART_IS_RX_READY(UART0))
    {
        *out = (char)UART_READ(UART0);
        return 1;
    }
    return 0;
}

/**
 * @brief Read a line from UART0, blocking until CR/LF.
 * @param buf Destination buffer to store the line.
 * @param buf_len Size of the destination buffer.
 */
static void UART0_ReadLineBlocking(char *buf, uint32_t buf_len)
{
    uint32_t idx = 0;
    while (1)
    {
        char c = 0;
        if (UART0_ReadCharNonBlocking(&c))
        {
            if (c == '\r' || c == '\n')
            {
                if (idx < buf_len)
                {
                    buf[idx] = '\0';
                }
                return;
            }
            if (idx + 1 < buf_len)
            {
                buf[idx++] = c;
            }
        }
    }
}

/* ------------------------------------------------------------------ */
/* AT+TEST= command dispatcher (forward declaration)                   */
/* ------------------------------------------------------------------ */
static void AT_DispatchCommand(const char *line);

/* ------------------------------------------------------------------ */
/* Poll entry: detect "test" OR "AT+TEST=" prefix                      */
/* ------------------------------------------------------------------ */

#define AT_PREFIX "AT+TEST="
#define AT_PREFIX_LEN 8
#define CMD_BUF_SIZE 64

/* Shared AT test thresholds/timeouts (single item + ALL must stay aligned) */
#define TEST_I2C_MAG_MIN_G 0.2f /* low floor: tilted board at cpg=2048 may read ~0.3g and still be alive */
#define TEST_I2C_MAG_MAX_G 2.0f
#define TEST_BLE_SETTLE_MS 200u
#define TEST_BLE_NAME_TIMEOUT_MS 2500u
#define TEST_BLE_MAC_TIMEOUT_MS 3000u
#define TEST_GSENSOR_CAL_SAMPLES 64u
#define TEST_GSENSOR_CAL_SAMPLE_INTERVAL_MS 20u

static float s_gsensor_cal_scale = 1.0f;
static uint8_t s_gsensor_cal_valid = 0u;

/**
 * @brief Poll UART0 for the test menu entry command or AT+TEST prefix.
 *
 * If the user types "test" on UART0, interactive test mode is entered.
 * If an AT+TEST= command is received, it is dispatched immediately.
 */
void TestMode_PollEnter(void)
{
    static char cmd_buf[CMD_BUF_SIZE];
    static uint8_t cmd_idx = 0;
    char c = 0;

    while (UART0_ReadCharNonBlocking(&c))
    {
        if (c == '\r' || c == '\n')
        {
            if (cmd_idx == 0)
                continue; /* ignore empty lines */

            cmd_buf[cmd_idx] = '\0';

            /* Check for AT+TEST= prefix first */
            if (cmd_idx >= AT_PREFIX_LEN &&
                strncmp(cmd_buf, AT_PREFIX, AT_PREFIX_LEN) == 0)
            {
                AT_DispatchCommand(cmd_buf + AT_PREFIX_LEN);
            }
            else if (strcmp(cmd_buf, "test") == 0)
            {
                g_uart_test_mode = 1u;
            }

            cmd_idx = 0;
            cmd_buf[0] = '\0';
            return;
        }

        if (cmd_idx + 1 < sizeof(cmd_buf))
        {
            cmd_buf[cmd_idx++] = c;
        }
    }
}

static void Test_LED(void)
{
    printf("[Test] LED PB3 blink x3\n");
    for (int i = 0; i < 3; ++i)
    {
        PB->DOUT |= BIT3;
        delay_ms(100);
        PB->DOUT &= ~BIT3;
        delay_ms(100);
    }
}

static void Test_Buzzer(void)
{
    printf("[Test] Buzzer PC7 beep\n");
    BuzzerPlay(1000, 200);
    delay_ms(250);
}

static void Test_Key(void)
{
    printf("[Test] Key PB15: press within 5s\n");
    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, 5000))
    {
        if ((GPIO_GET_IN_DATA(PB) & BIT15) == 0)
        {
            printf("[Test] Key pressed\n");
            return;
        }
    }
    printf("[Test] Key TIMEOUT\n");
}

static void Test_Hall(void)
{
    printf("[Test] HALL PB7/PB8: read for 3s\n");
    uint32_t start = get_ticks_ms();
    uint32_t last_pb7 = (PB->PIN & BIT7) ? 1u : 0u;
    uint32_t last_pb8 = (PB->PIN & BIT8) ? 1u : 0u;
    while (!is_timeout(start, 3000))
    {
        uint32_t pb7 = (PB->PIN & BIT7) ? 1u : 0u;
        uint32_t pb8 = (PB->PIN & BIT8) ? 1u : 0u;
        if (pb7 != last_pb7 || pb8 != last_pb8)
        {
            printf("[Test] PB7=%lu PB8=%lu\n", (unsigned long)pb7, (unsigned long)pb8);
            last_pb7 = pb7;
            last_pb8 = pb8;
        }
        delay_ms(50);
    }
}

static void Test_Gsensor(void)
{
    printf("[Test] G-sensor I2C read (3 samples)\n");
    for (int i = 0; i < 3; ++i)
    {
        int16_t axis[3] = {0};
        GsensorReadAxis(axis);
        printf("[Test] XYZ = %d, %d, %d\n", axis[0], axis[1], axis[2]);
        delay_ms(50);
    }
}

static void Test_ADC(void)
{
    printf("[Test] VDDA (band-gap)\n");
    Adc_UpdateVdda();
    float vdda = Adc_GetVdda();
    uint32_t vdda_mv = (uint32_t)(vdda * 1000.0f);
    uint32_t low_mv = (uint32_t)(ADC_VDDA_LOW_V * 100.0f);
    printf("[Test] vdda=%lu.%03luV (low<%lu.%02luV) %s\n",
           (unsigned long)(vdda_mv / 1000u), (unsigned long)(vdda_mv % 1000u),
           (unsigned long)(low_mv / 100u), (unsigned long)(low_mv % 100u),
           Adc_IsVddaLow() ? "LOW" : "OK");
}

