wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
static void Test_USB(void)
{
    printf("[Test] USB FS HID Mouse auto test: 5s\n");
    UsbHidMouse_TestStart();

    uint32_t start = get_ticks_ms();
    uint32_t last_update = get_ticks_ms();
    while (!is_timeout(start, 5000))
    {
        if (get_elapsed_ms(last_update) >= 1u)
        {
            last_update = get_ticks_ms();
            UsbHidMouse_TestUpdate();
        }
    }

    UsbHidMouse_TestStop();
    printf("[Test] USB auto test done\n");
}

static uint8_t Test_BLE_WaitMode(uint8_t target_mode, uint32_t timeout_ms)
{
    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, timeout_ms))
    {
        CheckBleRecvMsg();
        if (Sys_GetBleMode() == target_mode)
        {
            return 1u;
        }
        delay_ms(5u);
    }
    return 0u;
}

static uint8_t Test_BLE_SwitchToCmdMode(void)
{
    Sys_SetBleMode(0u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_DLPS_OFF);
    delay_ms(60u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_ADVERT_ON);
    delay_ms(30u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_MODE_DATA);
    (void)Test_BLE_WaitMode(1u, 800u);

    /* Single attempt only: if CMD mode cannot be entered once, fail. */
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_CCMD);
    uint8_t ok = Test_BLE_WaitMode(0u, 1200u);
    return ok;
}

static uint8_t Test_BLE_SwitchToDataMode(void)
{
    Sys_SetBleMode(0u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_MODE_DATA);
    return Test_BLE_WaitMode(1u, 400u);
}

static uint8_t Test_BLE_CopyDeviceNameSnapshot(char *dst, uint32_t dst_size)
{
    return (uint8_t)(Sys_CopyDeviceName(dst, dst_size) > 0u);
}

static uint8_t Test_BLE_CopyMacAddrSnapshot(char *dst, uint32_t dst_size)
{
    return (uint8_t)(Sys_CopyMacAddr(dst, dst_size) > 0u);
}

static void Test_BLE_AT_CMD(void)
{
    const uint32_t timeout_ms = 2000u;
    uint32_t start = get_ticks_ms();
    uint8_t got_name_resp = 0u;
    uint8_t pass = 0u;
    char device_name[SYS_DEVICE_NAME_BUF_SIZE];

    printf("[Test] BLE AT CMD: query name, expect ROPR_\n");

    if (!Test_BLE_SwitchToCmdMode())
    {
        printf("[Test] BLE_AT_CMD FAIL: cannot enter CMD mode after retries\n");
        return;
    }

    Sys_ClearDeviceName();
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_NAME_QUERY);

    while (!is_timeout(start, timeout_ms))
    {
        CheckBleRecvMsg();

        if (Test_BLE_CopyDeviceNameSnapshot(device_name, (uint32_t)sizeof(device_name)))
        {
            got_name_resp = 1u;
            printf("[Test] BLE NAME = %s\n", device_name);

            /* Single read result: one response is enough to decide pass/fail. */
            if ((strstr(device_name, "ROPR_") != NULL) || (strstr(device_name, "ROPE_") != NULL))
            {
                pass = 1u;
            }
            break;
        }

        delay_ms(5u);
    }

    if (pass)
    {
        printf("[Test] BLE_AT_CMD PASS\n");
    }
    else if (!got_name_resp)
    {
        printf("[Test] BLE_AT_CMD FAIL: no name response\n");
    }
    else
    {
        printf("[Test] BLE_AT_CMD FAIL: name format invalid\n");
    }

    if (!Test_BLE_SwitchToDataMode())
    {
        printf("[Test] WARN: failed to return DATA mode\n");
    }
}

static void RunAllTests(void)
{
    Test_LED();
    Test_Buzzer();
    Test_Key();
    Test_Hall();
    Test_Gsensor();
    Test_ADC();
}

static void UART0_TestMenuLoop(void)
{
    char line[8];
    printf("\n=== UART0 Test Mode ===\n");
    printf("1) LED PB3\n");
    printf("2) Buzzer PC7\n");
    printf("3) Key PB15\n");
    printf("4) HALL PB7/PB8\n");
    printf("5) G-sensor I2C\n");
    printf("6) ADC PB1\n");
    printf("7) Run all tests\n");
    printf("8) USB FS HID Mouse (auto 5s)\n");
    printf("9) BLE AT CMD name check\n");
    printf("0) Exit\n");

    while (g_uart_test_mode)
    {
        printf("Select> ");
        UART0_ReadLineBlocking(line, sizeof(line));

        switch (line[0])
        {
        case '1':
            Test_LED();
            break;
        case '2':
            Test_Buzzer();
            break;
        case '3':
            Test_Key();
            break;
        case '4':
            Test_Hall();
            break;
        case '5':
            Test_Gsensor();
            break;
        case '6':
            Test_ADC();
            break;
        case '7':
            RunAllTests();
            break;
        case '8':
            Test_USB();
            break;
        case '9':
            Test_BLE_AT_CMD();
            break;
        case '0':
            g_uart_test_mode = 0u;
            printf("Exit test mode\n");
            break;
        default:
            printf("Unknown option\n");
            break;
        }
    }
}

void TestMode_RunMenuIfActive(void)
{
    if (g_uart_test_mode)
    {
        UART0_TestMenuLoop();
    }
}

/* ================================================================== */
/*  AT+TEST= Auto-Test Command Implementations                        */
/* ================================================================== */

/* Helper: parse a uint32 from string, returns 0 on empty/null */
static uint32_t parse_u32(const char *s)
{
    if (!s || !*s)
        return 0u;
    return (uint32_t)strtoul(s, NULL, 10);
}

/* Helper: find next comma-delimited token; returns pointer after comma or NULL */
static const char *next_param(const char *s)
{
    if (!s)
        return NULL;
    const char *p = strchr(s, ',');
    if (p)
        return p + 1;
    return NULL;
}

/* Helper: copy first comma-delimited token into buf (upper-bound len) */
static void copy_token(const char *s, char *buf, uint32_t buf_len)
{
    uint32_t i = 0;
    if (!s)
    {
        buf[0] = '\0';
        return;
    }
    while (*s && *s != ',' && i + 1 < buf_len)
    {
        buf[i++] = *s++;
    }
    buf[i] = '\0';
}

