wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
/* ------------------------------------------------------------------ */
/* AT+TEST=INFO                                                        */
/* ------------------------------------------------------------------ */
static uint8_t AT_Info(const char *param)
{
    (void)param;
    printf("+TEST:INFO,PASS,FW=%s,BRD=%s,BUILD=%s_%s\r\n",
           TEST_FW_VERSION, TEST_BOARD_NAME, FW_BUILD_DATE, FW_BUILD_TIME);
    return 1u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=LED,<ON|OFF|BLINK>                                          */
/* ------------------------------------------------------------------ */
static uint8_t AT_Led(const char *param)
{
    char tok[8];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "ON") == 0)
    {
        PB->DOUT |= BIT3;
        printf("+TEST:LED,PASS,STATE=ON\r\n");
        return 1u;
    }
    if (strcmp(tok, "OFF") == 0)
    {
        PB->DOUT &= ~BIT3;
        printf("+TEST:LED,PASS,STATE=OFF\r\n");
        return 1u;
    }
    if (strcmp(tok, "BLINK") == 0)
    {
        for (int i = 0; i < 3; ++i)
        {
            PB->DOUT |= BIT3;
            delay_ms(100);
            PB->DOUT &= ~BIT3;
            delay_ms(100);
        }
        printf("+TEST:LED,PASS,BLINK=3\r\n");
        return 1u;
    }
    printf("+TEST:LED,FAIL,BAD_PARAM\r\n");
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=BUZZER[,freq,dur]                                           */
/* ------------------------------------------------------------------ */
static uint8_t AT_Buzzer(const char *param)
{
    uint32_t freq = 1000u;
    uint32_t dur = 200u;

    if (param && *param)
    {
        freq = parse_u32(param);
        const char *p2 = next_param(param);
        if (p2)
            dur = parse_u32(p2);
    }

    if (freq == 0)
        freq = 1000u;
    if (dur == 0)
        dur = 200u;

    BuzzerPlay(freq, dur);
    delay_ms(dur + 50u);

    printf("+TEST:BUZZER,PASS,FREQ=%lu,DUR=%lu\r\n",
           (unsigned long)freq, (unsigned long)dur);
    return 1u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=KEY[,timeout_ms]                                            */
/* ------------------------------------------------------------------ */
static uint8_t AT_Key(const char *param)
{
    uint32_t timeout = 5000u;

    if (param && *param)
        timeout = parse_u32(param);
    if (timeout == 0)
        timeout = 5000u;

    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, timeout))
    {
        if ((GPIO_GET_IN_DATA(PB) & BIT15) == 0)
        {
            uint32_t elapsed = get_elapsed_ms(start);
            printf("+TEST:KEY,PASS,T=%lu\r\n", (unsigned long)elapsed);
            return 1u;
        }
    }
    printf("+TEST:KEY,FAIL,TIMEOUT\r\n");
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=HALL  or  AT+TEST=HALL,WAIT,timeout_ms                      */
/* ------------------------------------------------------------------ */
static uint8_t AT_Hall(const char *param)
{
    char tok[8];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "WAIT") == 0)
    {
        /* Wait for PB7 to produce >= 2 edge transitions (interrupts).
           Only PB7 is evaluated; PB8 is ignored in WAIT mode. */
        const char *p2 = next_param(param);
        uint32_t timeout = 3000u;
        if (p2 && *p2)
            timeout = parse_u32(p2);
        if (timeout == 0)
            timeout = 3000u;

        uint32_t last_pb7 = (PB->PIN & BIT7) ? 1u : 0u;
        uint32_t pb7_edges = 0u;
        uint32_t start = get_ticks_ms();

        while (!is_timeout(start, timeout))
        {
            uint32_t pb7_now = (PB->PIN & BIT7) ? 1u : 0u;
            if (pb7_now != last_pb7)
            {
                pb7_edges++;
                last_pb7 = pb7_now;
                if (pb7_edges >= 2u)
                {
                    printf("+TEST:HALL,PASS,EDGE=PB7,CNT=%lu,T=%lu\r\n",
                           (unsigned long)pb7_edges, (unsigned long)get_elapsed_ms(start));
                    return 1u;
                }
            }
            delay_ms(2);
        }
        printf("+TEST:HALL,FAIL,TIMEOUT,CNT=%lu\r\n", (unsigned long)pb7_edges);
        return 0u;
    }

    /* Instant read */
    uint32_t pb7 = (PB->PIN & BIT7) ? 1u : 0u;
    uint32_t pb8 = (PB->PIN & BIT8) ? 1u : 0u;
    printf("+TEST:HALL,PASS,PB7=%lu,PB8=%lu\r\n",
           (unsigned long)pb7, (unsigned long)pb8);
    return 1u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=GSENSOR                                                     */
/* ------------------------------------------------------------------ */
static uint8_t AT_GsensorCal(void)
{
    float sum_mag = 0.0f;

    for (uint32_t i = 0u; i < TEST_GSENSOR_CAL_SAMPLES; i++)
    {
        int16_t axis[3] = {0};
        GsensorReadAxis(axis);
        sum_mag += Gsensor_CalcMagnitude_g_from_raw(axis);
        delay_ms(TEST_GSENSOR_CAL_SAMPLE_INTERVAL_MS);
    }

    float avg_mag = sum_mag / (float)TEST_GSENSOR_CAL_SAMPLES;
    if (avg_mag < 0.05f)
    {
        s_gsensor_cal_scale = 1.0f;
        s_gsensor_cal_valid = 0u;
        printf("+TEST:GSENSOR,FAIL,CAL,NO_VALID_DATA\r\n");
        return 0u;
    }

    s_gsensor_cal_scale = 1.0f / avg_mag;
    s_gsensor_cal_valid = 1u;

    uint32_t avg_mag_i = (uint32_t)(avg_mag * 1000.0f);
    uint32_t scale_i = (uint32_t)(s_gsensor_cal_scale * 1000000.0f);
    printf("+TEST:GSENSOR,PASS,CAL,SAMPLES=%lu,G_AVG=%lu.%03lu,SCALE=%lu.%06lu\r\n",
           (unsigned long)TEST_GSENSOR_CAL_SAMPLES,
           (unsigned long)(avg_mag_i / 1000u), (unsigned long)(avg_mag_i % 1000u),
           (unsigned long)(scale_i / 1000000u), (unsigned long)(scale_i % 1000000u));
    return 1u;
}

static uint8_t AT_Gsensor(const char *param)
{
    char tok[8];
    copy_token(param, tok, sizeof(tok));

