wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
    if (strcmp(tok, "CAL") == 0)
    {
        return AT_GsensorCal();
    }
    if (tok[0] != '\0')
    {
        printf("+TEST:GSENSOR,FAIL,BAD_PARAM\r\n");
        return 0u;
    }

    /* Force sensor into a known-good state and let it settle.
       In ALL mode the LED+Buzzer tests provide ~850 ms of idle I2C time
       before GSENSOR is read; single-item mode needs an explicit settling
       period to match that behaviour.  GsensorWakeup() re-writes the
       control register so the conversion pipeline is cleanly restarted. */
    GsensorWakeup();
    delay_ms(100u); /* >12 full conversion cycles at ~125 Hz ODR */

    /* Flush stale / transitional samples */
    for (uint32_t d = 0u; d < 5u; d++)
    {
        int16_t dummy[3] = {0};
        GsensorReadAxis(dummy);
        delay_ms(10u);
    }

    /* Average 8 fresh samples for the final reading */
    int32_t sum_axis[3] = {0, 0, 0};
    for (uint32_t i = 0; i < 8u; ++i)
    {
        int16_t tmp[3] = {0};
        GsensorReadAxis(tmp);
        sum_axis[0] += tmp[0];
        sum_axis[1] += tmp[1];
        sum_axis[2] += tmp[2];
        if (i < 7u)
            delay_ms(10u);
    }
    int16_t axis[3];
    axis[0] = (int16_t)(sum_axis[0] / 8);
    axis[1] = (int16_t)(sum_axis[1] / 8);
    axis[2] = (int16_t)(sum_axis[2] / 8);

    /* Validate: static magnitude should be ~1G, using project tolerance. */
    float mag_raw_g = Gsensor_CalcMagnitude_g_from_raw(axis);
    float mag_cal_g = mag_raw_g * s_gsensor_cal_scale;
    float err_raw_g = (mag_raw_g >= 1.0f) ? (mag_raw_g - 1.0f) : (1.0f - mag_raw_g);
    float err_cal_g = (mag_cal_g >= 1.0f) ? (mag_cal_g - 1.0f) : (1.0f - mag_cal_g);
    uint8_t use_cal = (s_gsensor_cal_valid && (err_cal_g < err_raw_g)) ? 1u : 0u;
    float mag_eval_g = use_cal ? mag_cal_g : mag_raw_g;
    float mag_min_g = 1.0f - MOVEMENT_MAG_TOLERANCE_G;
    float mag_max_g = 1.0f + MOVEMENT_MAG_TOLERANCE_G;

    if (mag_eval_g >= mag_min_g && mag_eval_g <= mag_max_g)
    {
        uint32_t raw_i = (uint32_t)(mag_raw_g * 1000.0f);
        uint32_t cal_i = (uint32_t)(mag_cal_g * 1000.0f);
        uint32_t use_i = (uint32_t)(mag_eval_g * 1000.0f);
        printf("+TEST:GSENSOR,PASS,X=%d,Y=%d,Z=%d,G_RAW=%lu.%03lu,G_CAL=%lu.%03lu,G_USE=%lu.%03lu,SRC=%s,CAL=%u\r\n",
               axis[0], axis[1], axis[2],
               (unsigned long)(raw_i / 1000u), (unsigned long)(raw_i % 1000u),
               (unsigned long)(cal_i / 1000u), (unsigned long)(cal_i % 1000u),
               (unsigned long)(use_i / 1000u), (unsigned long)(use_i % 1000u),
               use_cal ? "CAL" : "RAW", (unsigned)s_gsensor_cal_valid);
        return 1u;
    }
    {
        uint32_t raw_i = (uint32_t)(mag_raw_g * 1000.0f);
        uint32_t cal_i = (uint32_t)(mag_cal_g * 1000.0f);
        uint32_t use_i = (uint32_t)(mag_eval_g * 1000.0f);
        printf("+TEST:GSENSOR,FAIL,G_RAW=%lu.%03lu,G_CAL=%lu.%03lu,G_USE=%lu.%03lu,SRC=%s,CAL=%u,X=%d,Y=%d,Z=%d\r\n",
               (unsigned long)(raw_i / 1000u), (unsigned long)(raw_i % 1000u),
               (unsigned long)(cal_i / 1000u), (unsigned long)(cal_i % 1000u),
               (unsigned long)(use_i / 1000u), (unsigned long)(use_i % 1000u),
               use_cal ? "CAL" : "RAW",
               (unsigned)s_gsensor_cal_valid, axis[0], axis[1], axis[2]);
    }
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=ADC                                                         */
/* ------------------------------------------------------------------ */
static uint8_t AT_Adc(const char *param)
{
    (void)param;
    Adc_UpdateVdda();
    float vdda = Adc_GetVdda();
    uint32_t vdda_mv = (uint32_t)(vdda * 1000.0f);

    if (vdda >= 2.0f && vdda <= 4.0f)
    {
        printf("+TEST:ADC,PASS,VDDA_MV=%lu\r\n", (unsigned long)vdda_mv);
        return 1u;
    }
    printf("+TEST:ADC,FAIL,OUT_OF_RANGE\r\n");
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=I2C,SCAN                                                    */
/* ------------------------------------------------------------------ */
static uint8_t AT_I2c(const char *param)
{
    if (!param || strncmp(param, "SCAN", 4) != 0)
    {
        printf("+TEST:I2C,FAIL,BAD_PARAM\r\n");
        return 0u;
    }

    /* Use GsensorReadAxis to avoid raw I2C probing bus stalls. */
    int16_t axis[3] = {0};
    GsensorReadAxis(axis);

    float mag_g = Gsensor_CalcMagnitude_g_from_raw(axis);
    uint8_t addr = GsensorGetI2CAddress();
    const char *chip = GsensorGetDeviceName();

    /* If magnitude is in a reasonable range the sensor is alive. */
    if ((addr != 0u) && (mag_g >= TEST_I2C_MAG_MIN_G) && (mag_g <= TEST_I2C_MAG_MAX_G))
    {
        uint32_t mag_i = (uint32_t)(mag_g * 1000.0f);
        printf("+TEST:I2C,FOUND,ADDR=0x%02X,CHIP=%s\r\n", addr, chip);
        printf("+TEST:I2C,INFO,G=%lu.%03lu\r\n", (unsigned long)(mag_i / 1000u), (unsigned long)(mag_i % 1000u));
        printf("+TEST:I2C,PASS,COUNT=1\r\n");
        return 1u;
    }
    {
        uint32_t mag_i = (uint32_t)(mag_g * 1000.0f);
        printf("+TEST:I2C,INFO,G=%lu.%03lu,ADDR=0x%02X,CHIP=%s\r\n", (unsigned long)(mag_i / 1000u), (unsigned long)(mag_i % 1000u), addr, chip);
    }
    printf("+TEST:I2C,FAIL,NO_DEVICE\r\n");
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=BLE,NAME / AT+TEST=BLE,MAC                                 */
/* ------------------------------------------------------------------ */
static uint8_t AT_BleName(void)
{
    char device_name[SYS_DEVICE_NAME_BUF_SIZE];

    if (!Test_BLE_SwitchToCmdMode())
    {
        printf("+TEST:BLE,FAIL,CMD_MODE\r\n");
        return 0u;
    }

    /* Let BLE module settle after CMD mode switch and drain pending data */
    delay_ms(TEST_BLE_SETTLE_MS);
    CheckBleRecvMsg();

    Sys_ClearDeviceName();
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_NAME_QUERY);

    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, TEST_BLE_NAME_TIMEOUT_MS))
    {
        CheckBleRecvMsg();
        if (Test_BLE_CopyDeviceNameSnapshot(device_name, (uint32_t)sizeof(device_name)))
        {
            uint8_t ok = (strstr(device_name, "ROPR_") || strstr(device_name, "ROPE_")) ? 1u : 0u;
            printf("+TEST:BLE,%s,NAME=%s\r\n", ok ? "PASS" : "FAIL", device_name);
            Test_BLE_SwitchToDataMode();
            return ok;
        }
        delay_ms(5u);
    }

