wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
    /* 4. GSENSOR */
    TRACK(AT_Gsensor(NULL));

    /* 5. ADC */
    TRACK(AT_Adc(NULL));

    /* 6. I2C SCAN */
    TRACK(AT_I2c("SCAN"));

    /* 7. HALL instant read */
    TRACK(AT_Hall(NULL));

    /* 8-9. BLE NAME + MAC (combined CMD-mode session) */
    AT_All_Ble(&pass, &fail);

    /* 10. PWR VBUS */
    TRACK(AT_Pwr("VBUS"));

    /* 11. PWR LOCK */
    TRACK(AT_Pwr("LOCK"));

#undef TRACK

    uint32_t total = pass + fail;
    printf("+TEST:ALL,DONE,PASS=%lu,FAIL=%lu,TOTAL=%lu\r\n",
           (unsigned long)pass, (unsigned long)fail, (unsigned long)total);
    printf(fail == 0u ? "OK\r\n" : "ERROR\r\n");
}

/* ================================================================== */
/*  AT Command Dispatch Table                                          */
/* ================================================================== */

typedef uint8_t (*AT_Handler)(const char *param);

typedef struct
{
    const char *cmd;
    AT_Handler handler;
} AT_CmdEntry;

static const AT_CmdEntry s_at_cmd_table[] = {
    {"INFO", AT_Info},
    {"LED", AT_Led},
    {"BUZZER", AT_Buzzer},
    {"KEY", AT_Key},
    {"HALL", AT_Hall},
    {"GSENSOR", AT_Gsensor},
    {"ADC", AT_Adc},
    {"I2C", AT_I2c},
    {"BLE", AT_Ble},
    {"USB", AT_Usb},
    {"PWR", AT_Pwr},
};

#define AT_CMD_TABLE_SIZE (sizeof(s_at_cmd_table) / sizeof(s_at_cmd_table[0]))

/* ------------------------------------------------------------------ */
/* AT command dispatcher                                                */
/* ------------------------------------------------------------------ */
static void AT_DispatchCommand(const char *line)
{
    static uint8_t s_at_test_session_active = 0u;

    char cmd[12];
    copy_token(line, cmd, sizeof(cmd));
    const char *param = next_param(line);

    /* Explicit command to leave AT test session and resume normal game loop */
    if (strcmp(cmd, "EXIT") == 0)
    {
        s_at_test_session_active = 0u;
        Sys_SetReplMode(0u);
        Sys_SetLedOverride(0u);
        (void)Sys_TakeHallPb7PendingEdges();
        Sys_SetHallPb7IrqFlag(0);
        printf("+TEST:EXIT,PASS\r\n");
        printf("OK\r\n");
        return;
    }

    /* Enter/keep AT test session active: this keeps main loop out of game mode
       across commands (until AT+TEST=EXIT). */
    s_at_test_session_active = 1u;
    Sys_SetReplMode(1u);
    Sys_SetLedOverride(1u);

    /* Clear stale hall pending events right before handling command */
    (void)Sys_TakeHallPb7PendingEdges();
    Sys_SetHallPb7IrqFlag(0);

    if (strcmp(cmd, "ALL") == 0)
    {
        AT_All();
    }
    else
    {
        uint8_t found = 0u;
        for (uint32_t i = 0u; i < AT_CMD_TABLE_SIZE; i++)
        {
            if (strcmp(cmd, s_at_cmd_table[i].cmd) == 0)
            {
                uint8_t result = s_at_cmd_table[i].handler(param);
                printf(result ? "OK\r\n" : "ERROR\r\n");
                found = 1u;
                break;
            }
        }
        if (!found)
        {
            printf("+TEST:UNKNOWN,FAIL,BAD_CMD\r\n");
            printf("ERROR\r\n");
        }
    }

    /* Clear hall pending events once after command as well. */
    (void)Sys_TakeHallPb7PendingEdges();
    Sys_SetHallPb7IrqFlag(0);
}
